# Intro to postgreSQL and psycopg2

**Cameron Bronstein - _July, 2019_**

#### Dependencies

- `psycopg2`: version 2.7.7
- `postgreSQL`: [version 11.x](https://www.enterprisedb.com/downloads/postgres-postgresql-downloads)

#### Documentation
- [postgreSQL 11](https://www.postgresql.org/docs/11/index.html)

#### Data Sources
- [West Virginia Counties](https://www.westvirginia-demographics.com/counties_by_population)
- [Opioid Use Data](https://www.washingtonpost.com/graphics/2019/investigations/dea-pain-pill-database/?utm_term=.b945f1d2a341#download-resources)

In [ ]:
# in case psycopg2 is not installed...
# !pip install psycopg2-binary --user

In [4]:
# a few imports
import psycopg2
import pandas as pd

## Connecting to Postgres DB

**Arguments:**
- `host = localhost`
- `dbname` = **your choice of db**
- `user` = **your postgres username**

In [7]:
# establishin a connection
connection = psycopg2.connect(host = "localhost", dbname = "cambostein", user = "cambostein")

In [8]:
# creating the cursor - this is a python object that executes all of your SQL commands
cursor = connection.cursor()

### Create a table skeleton in the PG database

**Steps:**
- title
- column names
- column data types
- primary key

In [ ]:
command = """
CREATE TABLE west_virginia(
transaction_date date,
reporter_name varchar,
reporter_address varchar,
buyer_name varchar, 
buyer_category varchar,
buyer_address varchar,
buyer_county varchar,
product_name varchar,
drug_name varchar,
dosage_unit float,
quantity float,
base_wt_gm float,
labeler_name varchar,
company_name varchar)
"""

cursor.execute(command)

### Get the data

In [ ]:
# filling the empty table with data!
connection.commit()

with open("./data/west_virginia_for_lesson.tsv") as f:
    
    # why do we use next, here?
    next(f)
    
    # here is cursor, again
    cursor.copy_from(f, 'west_virginia', sep='\t')

# this establishes the end of a command block    
connection.commit()

In [13]:
# confirming that we have data

command = """
SELECT COUNT(*)
FROM west_virginia
"""

cursor.execute(command)

cursor.fetchall()

[(1879320,)]

### West Virgina Counties // Relational Databases

In [14]:
counties = pd.read_csv('./data/west_virginia_pop_by_county.csv')
counties.head()

       County  Population  Rank
0     KANAWHA      180454     1
1    BERKELEY      117123     2
2  MONONGALIA      106420     3
3      CABELL       93224     4
4        WOOD       84203     5

In [15]:
counties.head()

       County  Population  Rank
0     KANAWHA      180454     1
1    BERKELEY      117123     2
2  MONONGALIA      106420     3
3      CABELL       93224     4
4        WOOD       84203     5

<details>
  <summary>How would we create a counties table?</summary>
  
  ```
  CREATE TABLE counties(
  County varchar,
  Population integer,
  Rank integer)
  
  with open("./data/west_virgina_pop_by_county.csv") as f:
      next(f)
    
      cursor.copy_from(f, 'counties', sep=',')

  connection.commit()
  ```
</details>

In [ ]:
connection.commit()

command = """
CREATE TABLE counties(
county varchar,
population integer,
rank integer)
"""

cursor.execute(command)

In [ ]:
# fill the counties table with data!
with open("./data/west_virgina_pop_by_county.csv") as f:
    next(f)

    cursor.copy_from(f, 'counties', sep=',')

connection.commit()

### SQL portion

- **First, an aside:**
    - Case study: [Leavenworth County, Kansas](https://www.kcur.org/post/leavenworth-county-kansas-may-not-be-catastrophic-opioid-hotspot-new-data-appear-show#stream/0). This is important to being a data scientist, too!

In [17]:
# dislapy the column names from the west_virginia table 


command = """
SELECT column_name, data_type 
FROM information_schema.columns
WHERE table_name = 'west_virginia';
"""

# this is the necessary syntax for psycopg2

cursor.execute(command)
cursor.fetchall()

[('transaction_date', 'date'),
 ('reporter_name', 'character varying'),
 ('reporter_address', 'character varying'),
 ('buyer_name', 'character varying'),
 ('buyer_category', 'character varying'),
 ('buyer_address', 'character varying'),
 ('buyer_county', 'character varying'),
 ('product_name', 'character varying'),
 ('drug_name', 'character varying'),
 ('dosage_unit', 'double precision'),
 ('quantity', 'double precision'),
 ('base_wt_gm', 'double precision'),
 ('labeler_name', 'character varying'),
 ('company_name', 'character varying')]

#### About psycopg2:

- **Take notice of the output of `cusor.fetchall()`**
    - It returns a list of tuples, with each element in the tuple ordered by the information specified in our query.
    - For the purpose of this lesson, this data format might not make sense, but it is important to understand as future Data Engineers and Data Scientists. This format might be more useful in an ETL (extract, transform, load) pipeline than running the data through a Pandas DataFrame
    
- For the rest of this lesson, we will run our queries through `pandas` as you are likely familiar with from previous lessons and assignments. 
    - **But** our connection to the `postgres` database still relies on `psycopg2`

### Query 1

<details>
  <summary>List the top 10 opioid buyers by grams purchased:</summary>
  
  ```
SELECT buyer_name as buyer,
       SUM(base_wt_gm) as total_ordered
FROM west_virginia
GROUP BY buyer_name
ORDER BY total_ordered DESC
LIMIT 10;
  ```
</details>

In [20]:
connection.commit()

command = """
SELECT buyer_name as buyer,
       SUM(base_wt_gm) as total_purchased
FROM west_virginia
GROUP BY buyer_name
ORDER BY total_purchased DESC
LIMIT 10;
"""

dataframe = pd.read_sql(command, connection)
dataframe

                                buyer  total_purchased
0     RITE AID OF WEST VIRGINIA, INC.    852078.017207
1  WEST VIRGINIA CVS PHARMACY, L.L.C.    611592.554877
2                        WALGREEN CO.    143850.924917
3                     KROGER PHARMACY    119511.595889
4        FAMILY DISCOUNT PHARMACY INC     80820.607970
5              SAFESCRIPT PHARMACY #6     79154.099733
6                         COLONY DRUG     76463.343661
7                          STROSNIDER     75448.184850
8         CRAB ORCHARD PHARMACY, INC.     65116.365655
9                   WESTSIDE PHARMACY     63745.982688

### Query 2

<details>
  <summary>List the top 10 opioid buyers by number of transactions, compared to total grams ordered:</summary>
  
  ```
SELECT buyer_name as buyer,
       SUM(base_wt_gm) as total_ordered
       COUNT(buyer_name) as number_transactions
FROM west_virginia
GROUP BY buyer_name
ORDER BY number_transactions DESC
LIMIT 10;
  ```
</details>

In [22]:
connection.commit()

command = """
SELECT buyer_name as buyer,
       SUM(base_wt_gm) as total_purchased,
       COUNT(*) as number_transactions
FROM west_virginia
GROUP BY buyer_name
ORDER BY number_transactions DESC
LIMIT 10;
"""

dataframe = pd.read_sql(command, connection)
dataframe

                                buyer  total_purchased  number_transactions
0     RITE AID OF WEST VIRGINIA, INC.    852078.017207               279093
1  WEST VIRGINIA CVS PHARMACY, L.L.C.    611592.554877               170254
2                     KROGER PHARMACY    119511.595889                59640
3                        WALGREEN CO.    143850.924917                30605
4                      KMART PHARMACY     45872.402170                21902
5                      FRUTH PHARMACY     43430.998939                19041
6       FRITZ'S PHARMACY AND WELLNESS     63583.640840                13997
7                       DRUG EMPORIUM     48482.092400                13961
8                    MEDICAP PHARMACY     45884.606621                13870
9                      S & F PHARMACY     43398.957309                13301

### Query 3

<details>
  <summary>List the top 10 counties by number of transactions:</summary>
  
  ```
SELECT buyer_county as county,
       COUNT(buyer_county) as number_transactions
FROM west_virginia
GROUP BY county
ORDER BY number_transactions DESC
LIMIT 10;
  ```
</details>

In [24]:
connection.commit()

command = """
SELECT buyer_county as county,
       COUNT(*) as number_transactions
FROM west_virginia
GROUP BY county
ORDER BY number_transactions DESC
LIMIT 10;
"""

dataframe = pd.read_sql(command, connection)
dataframe

       county  number_transactions
0     KANAWHA               205127
1      CABELL               130426
2     RALEIGH               108253
3        WOOD                93235
4    HARRISON                84227
5    BERKELEY                81333
6  MONONGALIA                76353
7      MERCER                67443
8       LOGAN                65359
9      MARION                59912

### Query 4

<details>
  <summary>How does this compare to total number grams purchased per county?</summary>
  
  ```
SELECT buyer_county as county, 
       count(buyer_county) as number_transactions,
       SUM(base_wt_gm) as total_grams_purchased
FROM west_virginia
GROUP BY county
ORDER BY total_grams_purchased DESC
LIMIT 10;
  ```
</details>

In [25]:
connection.commit()

command = """
SELECT buyer_county as county, 
       count(buyer_county) as number_transactions,
       SUM(base_wt_gm) as total_grams_purchased
FROM west_virginia
GROUP BY county
ORDER BY total_grams_purchased DESC
LIMIT 10;
"""

dataframe = pd.read_sql(command, connection)
dataframe

       county  number_transactions  total_grams_purchased
0     KANAWHA               205127          590209.880169
1      CABELL               130426          503422.784330
2     RALEIGH               108253          444349.838749
3    BERKELEY                81333          309594.654079
4       LOGAN                65359          285758.722875
5    HARRISON                84227          258090.622130
6       MINGO                37154          228851.888449
7        WOOD                93235          201718.354192
8      MERCER                67443          199234.573589
9  GREENBRIER                54301          172816.286226

### Query 5

<details>
  <summary>What is the most common opioid product?</summary>
  
  ```
SELECT product_name as product,
       COUNT(product_name) as num_orders
FROM west_virginia
GROUP BY product
ORDER BY num_orders DESC
LIMIT 10;
  ```
</details>

In [ ]:
connection.commit()

command = """

"""

dataframe = pd.read_sql(command, connection)
dataframe

### Query 6

<details>
  <summary>How does opioid purchases compare to county population size?</summary>
  
  ```
SELECT w.buyer_county as county, 
       count(w.buyer_county) as number_transactions,
       SUM(w.base_wt_gm) as total_grams_purchased,
       c.Population as population
FROM west_virginia as w
JOIN counties AS c on c.County = w.buyer_county
GROUP BY w.buyer_county, c.Population
ORDER BY c.Population DESC
LIMIT 20;
  ```
</details>

In [ ]:
connection.commit()

command = """

"""

dataframe = pd.read_sql(command, connection)
dataframe

### Query 7

<details>
  <summary>How many counties have more opioid purchase transactions than people?</summary>
  
  ```
SELECT w.buyer_county as county, 
       count(w.buyer_county) as number_transactions,
       c.Population as population
FROM west_virginia as w
JOIN counties AS c on c.County = w.buyer_county
GROUP BY w.buyer_county, c.Population
HAVING count(w.buyer_county) > c.Population
ORDER BY number_transactions DESC
  ```
</details>

In [ ]:
connection.commit()

command = """

"""

dataframe = pd.read_sql(command, connection)
dataframe

### Query 8

<details>
  <summary>What is their average number of opioids ordered by grams? Average number of pills?</summary>
  
  ```
SELECT w.buyer_county as county, 
       count(w.buyer_county) as number_transactions,
       c.Population as population,
       AVG(w.base_wt_gm) as average_grams_per_order,
       AVG(w.dosage_unit) as average_pills_per_order
FROM west_virginia as w
JOIN counties AS c on c.County = w.buyer_county
GROUP BY w.buyer_county, c.Population
HAVING count(w.buyer_county) > c.Population
ORDER BY average_grams_per_order DESC;
  ```
</details>

In [29]:
connection.commit()

command = """
SELECT w.buyer_county as county, 
       count(w.buyer_county) as number_transactions,
       c.Population as population,
       AVG(w.base_wt_gm) as average_grams_per_order,
       AVG(w.dosage_unit) as average_pills_per_order
FROM west_virginia as w
JOIN counties AS c on c.County = w.buyer_county
GROUP BY w.buyer_county, c.Population
HAVING count(w.buyer_county) > c.Population
ORDER BY average_grams_per_order DESC;
"""

dataframe = pd.read_sql(command, connection)
dataframe

,county,number_transactions,population,average_grams_per_order,average_pills_per_order
0,MINGO,37154,23785,6.159549,1030.027184
1,WYOMING,29596,20786,5.484123,605.195972
2,MCDOWELL,27310,18223,4.440139,557.447821
3,LOGAN,65359,32607,4.372140,697.483132
4,BOONE,28640,21951,4.299602,655.025838
5,RALEIGH,108253,74254,4.104735,472.946893
6,CABELL,130426,93224,3.859835,499.999770
7,MARSHALL,37991,30785,3.288899,465.712669
8,NICHOLAS,37456,24842,3.281076,484.961021
9,GREENBRIER,54301,34786,3.182562,414.733099
10,HANCOCK,50706,29094,3.156169,388.165306
11,HARRISON,84227,67554,3.064227,477.454973
12,MERCER,67443,59131,2.954118,464.959892
13,KANAWHA,205127,180454,2.877290,440.252770
14,LINCOLN,20762,20599,2.786148,432.508429
15,FAYETTE,50581,43018,2.370842,396.036852
16,WETZEL,17426,15270,2.329962,456.198783
17,MARION,59912,56097,2.200199,369.097142
18,WOOD,93235,84203,2.163548,425.483992
19,JACKSON,34205,28706,2.158427,315.940140
20,LEWIS,19030,16024,2.106811,357.825013
21,ROANE,16141,13932,1.864851,319.478347

### Query 9

<details>
  <summary>What's the average number of pills per person per year?</summary>
  
  ```
SELECT w.buyer_county as county,
       c.Population as population,
       SUM(w.dosage_unit) as total_pills_purchased,
       SUM(w.dosage_unit) / 7 as pills_per_year,
       ((SUM(w.dosage_unit) / 7) / c.Population) as avg_pill_per_person 
FROM west_virginia as w
JOIN counties AS c on c.County = w.buyer_county
GROUP BY w.buyer_county, c.Population
ORDER BY avg_pill_per_person DESC;
  ```
</details>

In [28]:
connection.commit()

command = """
SELECT w.buyer_county as county,
       c.Population as population,
       SUM(w.dosage_unit) as total_pills_purchased,
       SUM(w.dosage_unit) / 7 as pills_per_year,
       ((SUM(w.dosage_unit) / 7) / c.Population) as avg_pill_per_person
FROM west_virginia as w
JOIN counties AS c on c.County = w.buyer_county
GROUP BY w.buyer_county, c.Population
ORDER BY avg_pill_per_person DESC
"""

dataframe = pd.read_sql(command, connection)
dataframe

,county,population,total_pills_purchased,pills_per_year,avg_pill_per_person
0,MINGO,23785,38269630.0,5.467090e+06,229.854530
1,LOGAN,32607,45586800.0,6.512400e+06,199.723986
2,WYOMING,20786,17911380.0,2.558769e+06,123.100576
3,BOONE,21951,18759940.0,2.679991e+06,122.089719
4,MCDOWELL,18223,15223900.0,2.174843e+06,119.346038
5,NICHOLAS,24842,18164700.0,2.594957e+06,104.458463
6,CABELL,93224,65212970.0,9.316139e+06,99.932835
7,RALEIGH,74254,51197920.0,7.313989e+06,98.499590
8,HANCOCK,29094,19682310.0,2.811759e+06,96.643932
9,GREENBRIER,34786,22520422.0,3.217203e+06,92.485573
10,HARRISON,67554,40214600.0,5.744943e+06,85.042231
11,MASON,26718,15502220.0,2.214603e+06,82.888048
12,MARSHALL,30785,17692890.0,2.527556e+06,82.103483
13,MERCER,59131,31358290.0,4.479756e+06,75.759850
14,WETZEL,15270,7949720.0,1.135674e+06,74.372907
15,KANAWHA,180454,90307730.0,1.290110e+07,71.492482
16,WOOD,84203,39670000.0,5.667143e+06,67.303337
17,FAYETTE,43018,20031940.0,2.861706e+06,66.523449
18,LINCOLN,20599,8979740.0,1.282820e+06,62.275839
19,LEWIS,16024,6809410.0,9.727729e+05,60.707243
20,BROOKE,22203,9396180.0,1.342311e+06,60.456309
21,BRAXTON,14089,5836440.0,8.337771e+05,59.179299
22,PLEASANTS,7507,2970380.0,4.243400e+05,56.525909
23,MARION,56097,22113348.0,3.159050e+06,56.314058
24,JACKSON,28706,10806732.5,1.543819e+06,53.780357
25,ROANE,13932,5156700.0,7.366714e+05,52.876215
26,RANDOLPH,28823,10617440.0,1.516777e+06,52.623847
27,OHIO,41755,15332080.0,2.190297e+06,52.455925
28,SUMMERS,12760,4515340.0,6.450486e+05,50.552396
29,WEBSTER,8285,2912140.0,4.160200e+05,50.213639
30,PUTNAM,56682,19513440.0,2.787634e+06,49.180239
31,WAYNE,39944,13732770.0,1.961824e+06,49.114367
32,BARBOUR,16535,5680250.0,8.114643e+05,49.075554
33,POCAHONTAS,8414,2851690.0,4.073843e+05,48.417434
34,MINERAL,26940,8193530.0,1.170504e+06,43.448563
35,MORGAN,17787,5096310.0,7.280443e+05,40.931258
36,HARDY,13775,3921700.0,5.602429e+05,40.670988
37,CLAY,8632,2339360.0,3.341943e+05,38.715742
38,BERKELEY,117123,31627440.0,4.518206e+06,38.576588
39,JEFFERSON,56811,15257640.0,2.179663e+06,38.366916
40,GRANT,11626,3014870.0,4.306957e+05,37.045907
41,TYLER,8746,2233890.0,3.191271e+05,36.488354
42,GILMER,8026,2037259.0,2.910370e+05,36.261774
43,RITCHIE,9721,2454570.0,3.506529e+05,36.071686
44,MONONGALIA,106420,25959877.0,3.708554e+06,34.848279
45,TAYLOR,16862,3960690.0,5.658129e+05,33.555501
46,UPSHUR,24415,5586120.0,7.980171e+05,32.685527
47,HAMPSHIRE,23347,5276860.0,7.538371e+05,32.288394
48,MONROE,13280,2868370.0,4.097671e+05,30.855960
49,PENDLETON,6997,1489710.0,2.128157e+05,30.415280
50,PRESTON,33839,5905090.0,8.435843e+05,24.929350
51,CALHOUN,7254,1159230.0,1.656043e+05,22.829375
52,WIRT,5830,808580.0,1.155114e+05,19.813281
53,TUCKER,6955,852090.0,1.217271e+05,17.502105
54,DODDRIDGE,8406,961790.0,1.373986e+05,16.345298

### Query 10

<details>
  <summary>Pills per person - Statewide:</summary>
  
  ```
SELECT AVG(a.avg_pill_per_person) as statewide_average
FROM
(SELECT w.buyer_county as county,
       c.Population as population,
       SUM(w.dosage_unit) as total_pills_purchased,
       SUM(w.dosage_unit) / 7 as pills_per_year,
       ((SUM(w.dosage_unit) / 7) / c.Population) as avg_pill_per_person
FROM west_virginia as w
JOIN counties AS c on c.County = w.buyer_county
GROUP BY w.buyer_county, c.Population
ORDER BY avg_pill_per_person DESC)
AS a;
  ```
</details>

In [27]:
connection.commit()

command = """
SELECT AVG(a.avg_pill_per_person) as statewide_average
FROM
(SELECT w.buyer_county as county,
       c.Population as population,
       SUM(w.dosage_unit) as total_pills_purchased,
       SUM(w.dosage_unit) / 7 as pills_per_year,
       ((SUM(w.dosage_unit) / 7) / c.Population) as avg_pill_per_person
FROM west_virginia as w
JOIN counties AS c on c.County = w.buyer_county
GROUP BY w.buyer_county, c.Population
ORDER BY avg_pill_per_person DESC)
AS a;
"""

dataframe = pd.read_sql(command, connection)
dataframe

   statewide_average
0          62.509378

### Query 11 - Group By Date

<details>
  <summary>Lets group opioid purchases by year:</summary>
  
  ```
SELECT to_char(transaction_date, 'YYYY') as year,
       COUNT(w.*) as number_transactions,
       SUM(w.dosage_unit) as total_pills
FROM west_virginia as w
JOIN counties AS c on c.County = w.buyer_county
GROUP BY year;
  ```
</details>

In [ ]:


connection.commit()

command = """

"""

dataframe = pd.read_sql(command, connection)
dataframe

## What else can you think of?
- Which suppliers were most prominant? Per year?
- County averages per year? How do we show this?
    - Queries can get complicated pretty quick!

## Command Line Tricks

- end all queries with `;`
- `\timing` to print query execution times in CLI.
- `\d+` to print database information
- `\d+ table_name` to print table information
- `CREATE INDEX idx_name ON table_name (column_name);`